v1 = int(input())
v2 = int(input())
v3 = int(input())
v12 = int(input())
v13 = int(input())
v23 = int(input())
v123 = int(input())


F1 = 1/3 * (v123 - v23) + 1/6 * (v12 - v2) + 1/6 * (v13 - v3) + 1/3 * v1
F2 = 1/3 * (v123 - v13) + 1/6 * (v12 - v1) + 1/6 * (v23 - v3) + 1/3 * v2
F3 = 1/3 * (v123 - v12) + 1/6 * (v13 - v1) + 1/6 * (v23 - v2) + 1/3 * v3

print(f"F1 = 1/3({v123} - {v23}) + 1/6({v12} - {v2}) + 1/6({v13} - {v3}) + 1/3({v1}) = {1/3 * (v123 - v23)} + {1/6 * (v12 - v2)} + {1/6 * (v13 - v3)} + {1/3 * v1} = {F1}")
print(f"F2 = 1/3({v123} - {v13}) + 1/6({v12} - {v1}) + 1/6({v23} - {v3}) + 1/3({v2}) = 1/3({v123 - v13}) + 1/6({v12 - v1}) + 1/6({v23 - v3}) + 1/3({v2}) = {F2}")
print(f"F3 = 1/3({v123} - {v12}) + 1/6({v13} - {v1}) + 1/6({v23} - {v2}) + 1/3({v3}) = 1/3({v123 - v12}) + 1/6({v13 - v1}) + 1/6({v23 - v2}) + 1/3({v3}) = {F3}")
if F1 + F2 + F3 != v123:
    print(f"Вектор Шепли не принадлежит C-ядру, так как сумма F1, F2 и F3 не равна V(1,2,3): {F1 + F2 + F3} != {v123}")
elif F1 < v1:
    print(f"Вектор Шепли не принадлежит C-ядру, так как F1 < V(1): {F1} < {v1}")
elif F2 < v2:
    print(f"Вектор Шепли не принадлежит C-ядру, так как F2 < V(2): {F2} < {v2}")
elif F3 < v3:
    print(f"Вектор Шепли не принадлежит C-ядру, так как F3 < V(3): {F3} < {v3}")
elif F1 + F2 < v12:
    print(f"Вектор Шепли не принадлежит C-ядру, так как сумма F1 и F2 меньше V(1,2): {F1 + F2} < {v12}")
elif F1 + F3 < v13:
    print(f"Вектор Шепли не принадлежит C-ядру, так как сумма F1 и F3 меньше V(1,3): {F1 + F3} < {v13}")
elif F2 + F3 < v23:
    print(f"Вектор Шепли не принадлежит C-ядру, так как сумма F2 и F3 меньше V(2,3): {F2 + F3} < {v23}")
else:
    print("Вектор Шепли принадлежит C-ядру.")
    print(f"F1 + F2 + F3 = {F1} + {F2} + {F3} = {F1 + F2 + F3}")
    print(f"F1 > V(1): {F1} > {v1}")
    print(f"F2 > V(2): {F2} > {v2}")
    print(f"F3 > V(3): {F3} > {v3}")
    print(f"F1 + F2 > V(1,2): {F1 + F2} > {v12}")
    print(f"F1 + F3 > V(1,3): {F1 + F3} > {v13}")
    print(f"F2 + F3 > V(2,3): {F2 + F3} > {v23}")